rottenpotatoes/app/controllers/movies_controller.rb

UPDATE "movies" SET "title" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Men In Black"], ["director", "Ridley Scott"], ["updated_at", "2015-11-20 20:55:24.466070"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)